Repository: OPUS4/application
Catalog: modules/search/language/collections.tmx
Source language: de
Languages: en

source: Alle Titel aus dem Repository
en: All titles in this repository

source: Browsing nach Autoren
en: Browse authors

source: Browsing nach Herausgebern
en: Browse editors

source: Browsing nach Berichtern
en: Browse advisors

source: Browsing nach beteiligten Personen
en: Browse contributors

source: Browsing nach Begutachtern
en: Browse referees

source: Browsing nach sonstigen beteiligten Personen
en: Browse other persons

source: Browsing nach Ãœbersetzern
en: Browse translators

source: Browsing nach Dokumenttypen
en: Browse document types

source: Browsing nach MSC-Klassifikation
en: Browse MSC-Classification

source: Meine Test-Sammlung
en: My Test Collection
